
&НаКлиенте
Процедура УдалитьСтрокиПоУсловию(Команда)
	
	СтрокиНаУдаление = ОтобратьСтроки();
	
	Для Каждого СтрокаОтобранная из СтрокиНаУдаление Цикл
		
		Объект.ТабличнаяЧастьТест.Удалить(СтрокаОтобранная);
		
	КонецЦикла; // СтрокаОтобранная
	
КонецПроцедуры

&НаКлиенте
Функция ОтобратьСтроки()
	
	// сб и вс
	ДниНеделиОтбора = Новый Массив;
	ДниНеделиОтбора.Добавить(6);
	ДниНеделиОтбора.Добавить(7);
	
	ДатаНач = Дата(1,1,1,10,0,0);
	ДатаКон = Дата(1,1,1,19,0,0);
	
	СтрокиНаУдаление = Новый Массив;
	
	Для Каждого СтрокаТЧ из Объект.ТабличнаяЧастьТест Цикл
		
		Добавлено = Ложь;
		НайденоПоДнюНедели = ДниНеделиОтбора.Найти(ДеньНедели(СтрокаТЧ.Дата));
		
		// Если индекс будет 0, то ЗначениеЗаполнено не подойдет
		Если Не НайденоПоДнюНедели = Неопределено Тогда
			СтрокиНаУдаление.Добавить(СтрокаТЧ);
			Продолжить;
		КонецЕсли;
		
		ДатаВремя = ПолучитьДатуИзСтроки(СтрокаТЧ.Время);
		Если ЗначениеЗаполнено(ДатаВремя) Тогда
			
			Если ДатаВремя <= ДатаНач Или ДатаВремя >= ДатаКон Тогда
				СтрокиНаУдаление.Добавить(СтрокаТЧ);
			КонецЕсли; // ДатаВремя < ДатаНач Или ДатаВремя > ДатаКон
			
		КонецЕсли; // ЗначениеЗаполнено
		
	КонецЦикла; // СтрокаТЧ
	
	Возврат СтрокиНаУдаление;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуИзСтроки(ВремяСтрокой)
	
	Попытка
		ВремяНов = СтрЗаменить(ВремяСтрокой,":","");
		ВремяНов = "00010101" + ВремяНов;
		Возврат Дата(ВремяНов);
	Исключение
		Возврат Неопределено
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Счет = 15;
	ДатаДляТЧ = ТекущаяДата();
	СуммаДляТЧ = 345;
	ДеньВСекундах = 60*60*24;
	
	Для Индекс = 0 по Счет Цикл
		
		СтрокаТЧ = Объект.ТабличнаяЧастьТест.Добавить();
		СтрокаТЧ.Дата = ДатаДляТЧ;
		СтрокаТЧ.Время = Формат(ДатаДляТЧ,"ДЛФ=T");
		СтрокаТЧ.Сумма = СуммаДляТЧ;
		
		ДатаДляТЧ = ДатаДляТЧ + ДеньВСекундах;
		СуммаДляТЧ = СуммаДляТЧ + 1;
		
	КонецЦикла;
	
КонецПроцедуры
