
Функция ЭтоФилиал(ЮрЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮрЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЮрЛица КАК ЮрЛица
		|ГДЕ
		|	НЕ ЮрЛица.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.ЮрЛица.ПустаяСсылка)
		|	И ЮрЛица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЮрЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Функция ПолучитьГоловнуюОрганизацию(ЮрЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮрЛица.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	Справочник.ЮрЛица КАК ЮрЛица
		|ГДЕ
		|	ЮрЛица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЮрЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ГоловнаяОрганизация;
		
	КонецЕсли;

КонецФункции