
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		
		Если ОбщегоНазначения.ЭтоФилиал(ГоловнаяОрганизация) Тогда
			Отказ = Истина;
			Сообщить("Филиал не может быть головной организацией");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись") Тогда
		
		Если Не ЭтотОбъект.ГоловнаяОрганизация = ОбщегоНазначения.ПолучитьГоловнуюОрганизацию(ЭтотОбъект.Ссылка) Тогда
			Отказ = Истина;
			Сообщить("Менять структуру филиалов вручную запрещено");
			Возврат;
		КонецЕсли; // Не ЭтотОбъект.ГоловнаяОрганизация
		
	КонецЕсли; // ДополнительныеСвойства
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ДополнительныеСвойства.Вставить("ИнтерактивнаяЗапись");
КонецПроцедуры

